In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [4]:
ser1 = Series(np.arange(3), index=['X','Y','Z'])

ser1 = 2*ser1

ser1

X    0
Y    2
Z    4
dtype: int32

In [6]:
ser1['Y']

2

In [7]:
ser1[2]

4

In [8]:
ser1[:1]

X    0
dtype: int32

In [9]:
# selecting with range by index
ser1[['X','Z']]

X    0
Z    4
dtype: int32

In [11]:
# selecting by logic
ser1[ser1 > 3]

Z    4
dtype: int32

In [13]:
# set values
ser1[ser1 > 3] = 10

ser1

X     0
Y     2
Z    10
dtype: int32

In [19]:
df1 = DataFrame(np.arange(25).reshape(5,5), index=['SF','DC','LA','NY','CH'],
                columns=['Q','W','E','R','T'])

df1

     Q   W   E   R   T
SF   0   1   2   3   4
DC   5   6   7   8   9
LA  10  11  12  13  14
NY  15  16  17  18  19
CH  20  21  22  23  24

In [20]:
# selecting by columns name
df1['Q']

SF     0
DC     5
LA    10
NY    15
CH    20
Name: Q, dtype: int32

In [21]:
df1

     Q   W   E   R   T
SF   0   1   2   3   4
DC   5   6   7   8   9
LA  10  11  12  13  14
NY  15  16  17  18  19
CH  20  21  22  23  24

In [22]:
df1[['W','T']]

     W   T
SF   1   4
DC   6   9
LA  11  14
NY  16  19
CH  21  24

In [23]:
df1[df1['R'] > 8]

     Q   W   E   R   T
LA  10  11  12  13  14
NY  15  16  17  18  19
CH  20  21  22  23  24

In [24]:
# boolean datafarame
df1 > 10

        Q      W      E      R      T
SF  False  False  False  False  False
DC  False  False  False  False  False
LA  False   True   True   True   True
NY   True   True   True   True   True
CH   True   True   True   True   True

In [25]:
# using 'ix' function
df1.ix['DC']

Q    5
W    6
E    7
R    8
T    9
Name: DC, dtype: int32

In [26]:
df1.ix[1]

Q    5
W    6
E    7
R    8
T    9
Name: DC, dtype: int32